---
kind: method
id: M:Autodesk.Revit.UI.ProjectBrowserOptions.Dispose
source: html/b670e717-9981-acde-1880-1d8c3002c07c.htm
---
# Autodesk.Revit.UI.ProjectBrowserOptions.Dispose Method

Releases all resources used by the ProjectBrowserOptions

## Syntax (C#)
```csharp
public void Dispose()
```